export default {
    // 名称 由英文或中文组成
    name: {
        reg: /^[A-Za-z\u4e00-\u9fa5]+$/,
        errMsg: "请输入真实姓名"
    },
    // 身份证号
    personId: {
        reg: /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/,
        errMsg: "请输入正确的身份证号码"
    },
    // 手机号
    mobile: {
        reg: /^1[3|4|5|6|7|8|9][0-9]\d{8}$/,
        errMsg: "请输入正确的手机号",
    },
    // 非法字符
    normal: {
        // 非法字符 ： @#\$%\^&\*
        reg: /^[\n-_—（）()【】{}\[\]！!、￥`· ,，.?？'""‘’“”:;：；/|A-Za-z0-9\u4e00-\u9fa5]+$/,
        errMsg: "不能包含非法字符"
    }
}